In [3]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
# we use Excepetion handling technique to connect to mysql server.
#The 'try' block lets use test a block of codes for errors and except block lets you test the errors 


def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print('MySQL Database connection succesful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection
    
# put mySQl Terminal password

pw = 'machine[]'

# Database name
db = "IBM_Sql_Magic"
connection = create_server_connection("localhost", 'root', pw)

MySQL Database connection succesful

In [8]:
# create table IBM_Sql_Magic
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print( 'Database created succesfully')
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = 'create database IBM_Sql_Magic'
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'ibm_sql_magic'; database exists'

In [4]:
# connect to database
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySQL Database connection succesful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [5]:
# Execute sql queries( user defined function)

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was succesful')
    except Error as err:
        print(f"Error: '{err}'")

In [6]:
# function to read and display the results

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [ ]:
con = sqlite3.connect("SQLiteMagic.db")
cur = con.cursor()

In [27]:
create_orders_tables = """
create table orders( order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
# connect to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_tables)

MySQL Database connection succesful
Query was succesful

In [28]:
# insert data

data_orders = '''
insert into orders values
(101, 'Steve', 'Laptop','2018-06-12', 2, 808, '6293730802'),
(102, 'Jos', 'Books', '2019-02-18', 10, 12, '8367489124'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),
(164, 'Nancy', 'T-Shirts', '2018-07-14', 7, 38, '7368145099'),
(185, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'),
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7728138449');
'''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL Database connection succesful
Query was succesful

In [29]:
# using the select statement to display result

q2 ="""
select customer_name, phone_number from orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL Database connection succesful
('Steve', '6293730802')
('Jos', '8367489124')
('Stacy', '8976123645')
('Danny', '7728138449')
('Nancy', '7368145099')
('Maria', '8865316698')

In [30]:
# using the select statement to display result

q3 ="""
select year(date_ordered) from orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL Database connection succesful
('Steve', '6293730802')
('Jos', '8367489124')
('Stacy', '8976123645')
('Danny', '7728138449')
('Nancy', '7368145099')
('Maria', '8865316698')

In [31]:
# using the select statement to display result

q4 ="""
select distinct year(date_ordered) from orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL Database connection succesful
(2018,)
(2019,)

In [32]:
# using the select statement to display result

q6 ="""
select * from orders order by unit_price desc;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL Database connection succesful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 808.0, '6293730802')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7728138449')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(185, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(164, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 38.0, '7368145099')
(102, 'Jos', 'Books', datetime.date(2019, 2, 18), 10, 12.0, '8367489124')

In [33]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name','produt_name',
           'date_ordered', 'quantity','unit_price','phone_number']
df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,produt_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,808.0,6293730802
1,106,Danny,Smart TV,2018-08-20,10,300.0,7728138449
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,185,Maria,Headphones,2019-05-30,6,48.0,8865316698
4,164,Nancy,T-Shirts,2018-07-14,7,38.0,7368145099
5,102,Jos,Books,2019-02-18,10,12.0,8367489124

In [34]:
# update command

update = '''
update orders
set unit_price = 45
where order_id = 103
'''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL Database connection succesful
Query was succesful

In [35]:

q9 = '''
select * from orders where order_id = 103
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL Database connection succesful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')

In [36]:
# Delete command

delete_order = '''
delete from orders
where order_id = 105;
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL Database connection succesful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')

In [37]:

q9 = '''
select * from orders
'''
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL Database connection succesful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 808.0, '6293730802')
(102, 'Jos', 'Books', datetime.date(2019, 2, 18), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7728138449')
(164, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 38.0, '7368145099')
(185, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')